Repository: turulomio/glparchis
Catalog: pyglParchis/doc/omegat-en/omegat-en-omegat.tmx
Source language: es_es
Languages: en_gb

source: - Agregadas texturas numéricas a las casillas
en_gb: - Numerical textures added to places

source: - Ahora el idioma por defecto es el inglés , pero en settings se puede cambiar el idioma y se graba en fichero de configuración
en_gb: - English is the default language. You can change the language at Settings. Settings will be saved for the next execution

source: - Ahora el splitter muestra el ogl por defecto
en_gb: - The splitter now shows the board by default

source: - Ahora permite guardar la partida cuando está con todos jugadores IA
en_gb: - You can save the game even when all the players are IA

source: - Ahora se muestra los primeros movimientos cuando empieza un jugador de AI
en_gb: - IA first movements are now showed

source: - Ahora se muestra un dado en Acerca De
en_gb: - About menu shows a dice

source: - Ahora se puede tirar el dado haciendo doble click encima del tablero.
en_gb: - Double click on the board to roll the dice

source: - Añadida distribución de binarios en windows y linux
en_gb: - Windows and Linux binary distribution

source: - Añadido apagar / encender sonido
en_gb: - Switch off / on sound added

source: - El texto del dado cambia de color según el jugador actual
en_gb: - Dice text changes color to the current player color

source: - Emite un sonido si se va por 3 seises a casa.
en_gb: - A sound plays after rolling 3 sixes, if you go home.

source: - Enlaces de pantalla ahora son clickables
en_gb: - Screen hyperlinks are now clickable.

source: - La aplicación es plenamente funcional.
en_gb: - The app has all the funcionality.

source: - Los popup no se salen de la pantalla.
en_gb: - All popups are now inside the screen

source: - Mejorada la inteligencia artificial de los jugadores virtuales, con un porcentaje de acierto en las decisiones
en_gb: - IA improved using probabilities.

source: - Mejorado el cmdDado
en_gb: - cmdDado improved

source: - Nueva opción de menú que busca actualizaciones de forma manual o cada 7 dias
en_gb: - New menu option to look for update manually or each 7 days

source: - Se ha añadido juegos de 6 y 8 jugadores
en_gb: - Added 6 and 8 players game

source: - Se ha añadido puntuación al juego teniendo en cuenta el número de casillas movidas.
en_gb: - Score system added. It uses the number of moved places.

source: - Se ha añadido soporte para highscores
en_gb: - Added support to highscores

source: - Se ha añadido un contador con el tiempo de partida transcurrido
en_gb: - A game timer has been added

source: - Se ha añadido un pequeño manual de ayuda al juego.
en_gb: - A game handbook have been added

source: - Se ha añadido una corona en la tabla de estadísticas al jugador que va ganando.
en_gb: - A crown is added in statistics table to show the player is winning the game.

source: - Se ha dado el soporte inicial a la aplicación
en_gb: - Initial support to the application

source: - Se ha mejorado la visualización de logs en pantalla
en_gb: - User panel logs have been improved

source: - Se ha puesto la visualización del dado en 3D
en_gb: - The dice is now in 3D

source: - Se han modificado los sonidos del juego
en_gb: - Game sounds updated

source: - Solucionado bug al cancelar en el dialogo inicial
en_gb: - Solved bug when pressing cancel at initial dialog

source: - Solucionado bug al pulsar la tecla ESCAPE.
en_gb: - Bug solved when pressing ESCAPE.

source: - Solucionado error al buscar si hay actualización disponible
en_gb: - Bug solved looking for game updates

source: - Solucionado problema con directorio de partidas guardadas
en_gb: - Solved bug with saved games directory

source: - Solucionado problema de un doble click en el dado
en_gb: - Dice double click bug solved

source: - Solucionados numeros bugs
en_gb: - Solved several bugs

source: - Solucionados varios bugs
en_gb: - Solved several bugs

source: - Solucionando problema con el sistema de consultar actualizaciones
en_gb: - Solved bug when there's a new game version

source: Ahora sale de la aplicación
en_gb: Now it exists the game

source: El programa tiene las siguientes dependencias:
en_gb: The app has the following dependencies:

source: Falta mejorar el IA de los jugadores virtuales
en_gb: We need to improve the virtual players

source: Idea y desarrollo
en_gb: Idea and development

source: Procedimiento de instalación para binarios linux
en_gb: Procedure to install the game from linux binaries

source: Procedimiento de instalación para binarios windows
en_gb: Procedure to install the game from windows binaries

source: Procedimiento de instalación para fuentes linux
en_gb: Procedure to install the game from linux sources

source: Procedimiento de instalación para fuentes windows
en_gb: Procedure to install the game from windows sources

source: Requisitos
en_gb: Requirements

source: Se descomprime el fichero
en_gb: Uncompres the file

source: Se descomprime el fichero con el comando
en_gb: Uncompress with the command:

source: Se entra en el directorio glparchis, que se acaba de crear con
en_gb: Enter in glparchis dirctory with:

source: Se puede acceder pulsando F1
en_gb: To read press F1

source: Si eres atrevido o quieres ayudarme con el desarrollo te lo puedes bajar del subversion con el siguiente comando
en_gb: If you want to help me, you can get the sourcecode from Sourceforge Subversion typing:

source: Si usas la distribución Gentoo, te puedes bajar el ebuild desde
en_gb: If you use Gentoo, you can download the ebuild from

source: Traducción
en_gb: Translation

source: Una vez en el directorio en el que esta el Makefile se ejecuta
en_gb: Change to the directory where the Makefile is and type

source: y se ejecuta el fichero glparchis con
en_gb: and execute the file glparchis
